Revit 2027 API
SectionType Enumeration
 Declares the section data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SectionType
Public Enumeration SectionType
public enum class SectionType
type SectionType
Members
Member name | Value | Description
Body | 1
Footer | 3
Header | 0
None | -1
Summary | 2
See Also
Reference
Autodesk.Revit.DB Namespace